Merge branch 'main' into fm/hive-bucket-a-defects
